Added some tests specific to this feature:

```
$ SKIP_PAID=1 TESTARGS="-run TestAccTFEWorkspace_createWithSource" make testacc
==> Checking that code complies with gofmt requirements...
TF_ACC=1 go test $(go list ./... |grep -v 'vendor') -v -run TestAccTFEWorkspace_createWithSource -timeout 15m
?   	github.com/hashicorp/terraform-provider-tfe	[no test files]
=== RUN   TestAccTFEWorkspace_createWithSourceURL
    resource_tfe_workspace_test.go:944: Step 1/1 error: After applying this test step, the plan was not empty.
        stdout:


        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement

        Terraform will perform the following actions:

          # tfe_workspace.foobar must be replaced
        -/+ resource "tfe_workspace" "foobar" {
              ~ execution_mode                = "remote" -> (known after apply)
              ~ global_remote_state           = false -> (known after apply)
              ~ id                            = "ws-z194mW93qgPQJdpa" -> (known after apply)
                name                          = "workspace-test"
              ~ operations                    = true -> (known after apply)
              ~ remote_state_consumer_ids     = [] -> (known after apply)
              - source_name                   = "https://example.com" -> null # forces replacement
              ~ terraform_version             = "1.2.4" -> (known after apply)
              ~ trigger_prefixes              = [] -> (known after apply)
                # (10 unchanged attributes hidden)
            }

        Plan: 1 to add, 0 to change, 1 to destroy.
--- FAIL: TestAccTFEWorkspace_createWithSourceURL (19.37s)
=== RUN   TestAccTFEWorkspace_createWithSourceURLAndName
--- PASS: TestAccTFEWorkspace_createWithSourceURLAndName (24.55s)
```

And it looks like there's actually a problem with my own functionality too, specifically how it handles the case where `source_name` is not set. Leave that with me, and I'll fix that.

(I might be trying to overcomplicate it actually; perhaps it's better not to try to be clever, and instead require that if either of `source_name` or `source_url` is set, then the other should be too 🤔)